cf/InformationRegisters/AuthorizationIn1cFresh.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>AuthorizationIn1cFresh</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Login</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SubscriberCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/AuthorizationIn1cFresh/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

Procedure AddRecord(User, Login, Password, SubscriberCode) Export
	
	Set = CreateRecordSet();
	Set.AdditionalProperties.Insert("Password", Password);
	Set.Filter.User.Set(User);
	Record = Set.Add();
	Record.User = User;
	Record.Login = Login;
	Record.SubscriberCode = SubscriberCode;
	Set.Write();
	
EndProcedure

// Secure storage owner.
// 
// Parameters:
//  User - CatalogRef.Users - User.
// 
// Returns:
//  String
Function OwnerOfSecureStorage(User) Export
	
	UserID_1 = Common.ObjectAttributeValue(User, "IBUserID");
	Return StrTemplate("User_%1", UserID_1);
	
EndFunction
  
// Read the data.
// 
// Parameters:
//  User - CatalogRef.Users
// 
// Returns:
//  Structure:
// * Login - String
// * Password - String
// * SubscriberCode - Number
Function Read(User) Export
	
	Manager = CreateRecordManager();
	Manager.User = User;
	Manager.Read();
	
	Data = New Structure;
	Data.Insert("Login", Manager.Login);
	
	SetPrivilegedMode(True);
	Owner = OwnerOfSecureStorage(User);
	Data.Insert("Password", String(Common.ReadDataFromSecureStorage(Owner)));
	Data.Insert("SubscriberCode", Manager.SubscriberCode);
	
	Return Data;
	
EndFunction
 
#EndRegion 
 
#EndIf
